# Practice Questions:

1. Write a SQL lites statement to create a table names as employees including columns
employee_id, first_name, last_name, email, phone_numberhire_date, job_id, salary,
commission, manager_id and department_id
i) Insert values in the table and also execute the table structure
ii) Display the first name, last name of an employees whose salary is greater than 25,000

In [ ]:
CREATE DATABASE Task;

USE Task;

CREATE TABLE employees
(employee_id int auto_increment, 
first_name char(100),
last_name char(100), 
email varchar(100), 
phone_number varchar(100), 
hire_date varchar(100), 
job_id int, 
salary int,
commission int,
manager_id int,
department_id int,
PRIMARY KEY(employee_id));

TRUNCATE TABLE employees;

ALTER TABLE employees
MODIFY COLUMN hire_date date;

INSERT INTO employees(first_name, last_name, email, phone_number, hire_date, job_id, salary, commission, manager_id, department_id)
VALUES ('Aditya', 'Udaya', 'ap@gmail.com', 457851224, '10-10-10', 1, 100000, 94564, 2, 1),
('Arun', 'Jangra', 'aj@gmail.com', 515451215, '11-11-11', 6, 10000, 654846, 4, 2),
('Sai', 'Kumar', 'sk@gmail.com', 84548454, '30-11-20', 4, 55541, 1000, 10, 11),
('Avinash', 'Bolla', 'ab@gmail.com', 876549854, '20-04-04', 8, 100040, 432164, 7, 8),
('Varma', 'Penmesta', 'vp@gmail.com', 78755884, '31-01-20', 10, 11646, 44654, 12, 21);

SELECT * FROM employees;

SELECT first_name, last_name FROM employees WHERE salary>25000;

2. Create a table for Student with the following fields (Reg_no,stud_name,sex, and create a
table Dept with the following fields(dept_no primary key, dept_name)
a. Insert sample records and do the following
b. Display the student reg_no,name and dept_name
c. Display the student names ending with „ka‟
d. Display all the female students name
e. Display the student names by descending order

In [ ]:
CREATE TABLE students(
reg_no varchar(100),
student_name char(100),
sex char(100));

CREATE TABLE department(
dept_no int, dept_name char(100));

INSERT INTO students()
VALUES ("RA16444684564", "Aditya", "male"),
("RA164446464654", "sanjuna", "female"),
("RA16444684564", "Dinesh", "male"),
("RA164446845854", "Arun", "male"),
("RA164446584545", "Sowmya", "male");

INSERT INTO department()
VALUES (1, "CSE"),
(2, "Mech"),
(3, "IT"),
(4, "Auto"),
(5, "Civil");

-- Not possible to merge the two columns as therse isn't any common column 

INSERT INTO students()
VALUES ("RA13115411254","Navika", "female");

SELECT student_name from students WHERE student_name LIKE '%ka';

SELECT student_name FROM students WHERE sex = 'female';

SELECT student_name FROM students ORDER BY student_name DESC;

# Graded

1. Create the below table and execute the insert, update and the below select statements.

i) Write a query to display the total number of recipes available with the description
“Chinese”
ii) Write a query to display the id, name of the recipes with chef_id &#39;BL000002&#39;. iii)
Write a query to display the description of the recipes whose name begins with &#39;P&#39;.

In [ ]:
import sqlite3 as sql
database=sql.connect("Market.txt")

database.execute('''
                 CREATE TABLE recipes(
                id int(11),
                name varchar(100),
                description text,
                category_id int(11),
                chef_id int(225),
                created datetime);
                 ''')


database.execute("SELECT COUNT(name) FROM recipes WHERE description= 'Chinese';")

database.execute("SELECT id, name FROM recipes WHERE chef_id='BL000002';")

database.execute("SELECT description FROM recipes WHERE name LIKE 'P%';")

2. Create a table movie of the below structure and assume data types.Movie_ID,
Movie_Name, Genre, Language, Rating ,Do the following queries
a. Update the movies rating by 10% and display it
b. Delete the movies with movie_id 102
c. Select movies whose rating is more than 3.

In [13]:
import sqlite3 as sql
database=sql.connect("Market.txt")

database.execute('''
                  CREATE TABLE movies(
                    Movie_ID varchar(100),
                    Movie_name char(100),
                    Genre char(100),
                    Language char(100),
                    Rating int);
                  ''')

database.execute("UPDATE movies SET Rating = 0.1+Rating Where True;")

database.execute("DELETE FROM movies WHERE Movie_ID=102;")

database.execute("SELECT * FROM movies WHERE Rating>3;")

3. Create a course database with the following fields Product(ID, Prod_name,
Supplier_id,Unit_price,Package,OrderID),OrderItem(ID,Order_id,Product_id,Unit_price,
Quantity) using Foreign key
d. Display the total quantity of every product in the stock
e. Sort the Unit_price based on the supplier_id
f. Display the Product_name along with order_id and supplier_id

In [ ]:
import sqlite3 as sql
database=sql.connect("Market.txt")

database.execute('''
                 CREATE TABLE product(
                ID int,
                Prod_name char(100),
                Supplier_id int,
                Unit_price int,
                Package char(100),
                Order_id int);
                 ''')

database.execute('''
                 CREATE TABLE orderItem(
                ID int, 
                Order_id int,
                Product_id int,
                Unit_price int,
                Quantity int);
                 ''')

database.execute('''
                 SELECT Prod_name, SUM(Quantity) FROM Product
                INNER JOIN OrderItem 
                ON Unit_price
                GROUP BY Prod_name;
                 ''')

database.execute("SELECT Unit_price, Supplier_id FROM Product ORDER BY Supplier_id;")

database.execute("SELECT Prod_name, Order_id, Supplier_id FROM Product;")

4. Write a SQL lite3 statement to create a table named as job including columns

job_id,job_title,Min-salary,Max_salary.job_id column does not contain any duplicate
value at the time of insertion

In [ ]:
import sqlite3 as sql
database=sql.connect("Market.txt")
database.execute('''CREATE TABLE job(
    job_id int UNIQUE, 
    job_title char(100),
    Min_salary int,
    Max_salary int);''')

5. Write a SQL lite3 statement to create a table names as job_history including columns
employee_id, start_date, end_date, job_id and department_id and make sure that, the
employee_id column does not contain any duplicate value at the time of insertion and the
foreign key column job_id contain only those values which are exists in the jobs table.

In [9]:
import sqlite3 as sql
database=sql.connect("Market.txt")
database.execute('''CREATE TABLE job_history(
    employee_id int UNIQUE,
    start_date date,
    end_date date,
    job_id int,
    department_id int,
    FOREIGN KEY(job_id) REFERENCES Persons(employee_id));''')